In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
con = engine.connect()
engine = create_engine("mysql+pymysql://root:@localhost:3306/portfolio_development")
conpf = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

In [2]:
name = "TFMAMA"

### MySQL Stock Database

In [3]:
sql = '''
DELETE FROM price
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM price
WHERE name = "TFMAMA"

In [4]:
rp = con.execute(sql)
rp.rowcount

762

In [5]:
sql = '''
DELETE FROM nameall
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM nameall
WHERE name = "TFMAMA"

In [6]:
rp = con.execute(sql)
rp.rowcount

0

In [7]:
sql = '''
DELETE FROM stockname
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM stockname
WHERE name = "TFMAMA"

In [8]:
rp = con.execute(sql)
rp.rowcount

0

### PostgreSQL PortPg Database

In [9]:
sql = """
SELECT * FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

SELECT * FROM yr_profits
WHERE name = 'TFMAMA'

In [10]:
df = pd.read_sql(sql, conpg)
df

,id,name,year,quarter,latest_amt,previous_amt,inc_amt,inc_pct,ticker_id
0,2020814,TFMAMA,2020,2,4250684,3709097,541587,14.601586,664
1,2020813,TFMAMA,2020,3,4174300,3883796,290504,7.479899,664
2,2020812,TFMAMA,2020,4,4090006,3943066,146940,3.726542,664
3,2020811,TFMAMA,2021,1,3929236,4083259,-154023,-3.770000,664
4,2020810,TFMAMA,2021,2,3665530,4250684,-585154,-13.766114,664
5,2020809,TFMAMA,2021,3,3662185,4174300,-512115,-12.270000,664
6,2020808,TFMAMA,2021,4,3574644,4090006,-515362,-12.600000,664
7,2020807,TFMAMA,2022,1,3338311,3929236,-590925,-15.040000,664

In [11]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'TFMAMA'

In [12]:
rp = conpg.execute(sql)
rp.rowcount

8

In [13]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'TFMAMA'

In [14]:
rp = conpg.execute(sql)
rp.rowcount

15

In [15]:
sql = """
DELETE FROM consensus
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM consensus
WHERE name = 'TFMAMA'

In [16]:
rp = conpg.execute(sql)
rp.rowcount

1

In [17]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TFMAMA'

In [18]:
rp = conpg.execute(sql)
rp.rowcount

1

In [19]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TFMAMA'

In [20]:
rp = conpg.execute(sql)
rp.rowcount

1

### SQLite PortMy Database

In [21]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TFMAMA'

In [22]:
rp = conmy.execute(sql)
rp.rowcount

1

In [23]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TFMAMA'

In [24]:
rp = conmy.execute(sql)
rp.rowcount

1

### SQLite PortLt Database

In [25]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'TFMAMA'

In [26]:
rp = conlt.execute(sql)
rp.rowcount

8

In [27]:
sql = """
DELETE FROM qt_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM qt_profits
WHERE name = 'TFMAMA'

In [28]:
rp = conlt.execute(sql)
rp.rowcount

11

In [29]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'TFMAMA'

In [30]:
rp = conlt.execute(sql)
rp.rowcount

15

In [31]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TFMAMA'

In [32]:
rp = conlt.execute(sql)
rp.rowcount

1

In [33]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TFMAMA'

In [34]:
rp = conlt.execute(sql)
rp.rowcount

1

### MySQL Portfolio Database

In [35]:
sql = """
SELECT * FROM stocks
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, conpf)
df

Empty DataFrame
Columns: [id, name, category_id, website]
Index: []